# Taps
tap "homebrew/bundle"
tap "databricks/tap"
tap "homebrew/cask-fonts"

# Cask
cask "iterm2"
cask "google-chrome"
cask "visual-studio-code"
cask "spotify"
cask "whatsapp"
cask "slack"
cask "obsidian"
cask "hammerspoon"
cask "copyq"
cask "claude-code"
cask "amethyst"
cask "font-fira-code"

# Core
brew "bash"
brew "pyenv"
brew "terraform"
brew "neovim"
brew "tmux"
brew "git"
brew "wget"
brew "zsh"
brew "tmuxinator"
brew "tree"
brew "virtualenv"
brew "cmake"
brew "pyenv-virtualenv"

# Development
brew "aws-sdk-cpp"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "kubernetes-cli"
brew "databricks/tap/databricks"
brew "helm"
brew "cmatrix"
brew "powerlevel10k"
brew "zsh-autocomplete"
brew "node" # for some language-servers
brew "zoxide"
brew "git-flow"
brew "jq"
brew "yazi"
brew "kubectx"
brew "openjdk@17"
brew "awscli"
brew "kdash-rs/kdash/kdash"

# Visual Code
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "NecatiARSLAN.airflow-vscode-extension"
vscode "njpwerner.autodocstring"
vscode "remcohaszing.schemastore"
vscode "samuelcolvin.jinjahtml"
vscode "Tim-Koehler.helm-intellisense"
vscode "tumido.cron-explained"
vscode "waderyan.gitblame"

# Office
brew "docker-credential-helper-ecr"
brew "saml2aws"

